Repository: OpenChain-Project/Specification-Translation-JP
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: **Please Translate Here.** In the event there is confusion between a translation and the English version, The English text shall take precedence.
ja: 翻訳版と英語版との間で何らかの意味の違いがあった場合には、英語版が優先されます。また、OpenChainは世界中のメンバー企業が参加するプロジェクトではありますが、資料の細部では必ずしも各国の法令を検討していない可能性もあります。本翻訳資料を日本で活用する際には、各企業の法務部門を加えた検討が不可欠です。

source: **Please Translate Here.** It has been translated from the original English text.
ja: 英文ドキュメントから翻訳された公式翻訳版です。

source: **Please Translate Here.** This is an official translation from the OpenChain Project.
ja: 本文書は、The Linux FoundationにおけるOpenChainプロジェクトの

source: A bill of materials is needed to support the systematic review of each component’s license terms to understand the obligations and restrictions as it applies to the distribution of the Supplied Software.
ja: 部品表は、各コンポーネントについて供給ソフトウェアを頒布する際に適用される義務、制約が書かれたライセンス条件を体系的に（システマチックに）レビューする上で必要となります。

source: A copy of the license can be found at https://creativecommons.org/licenses/by/4.0/ .
ja: ライセンスの写しは https://creativecommons.org/licenses/by/4.0/ で確認できます。

source: A copy of the license can be obtained here: CC-BY-4.0
ja: ライセンスの写しはこちらで入手できます。 CC-BY-4.0

source: A description of the SPDX specification can be found at ww.spdx.org.
ja: SPDXについてはwww.spdx.orgにその仕様が記載されている。

source: A description of the SPDX specification can be found at www.spdx.org.
ja: SPDXについてはwww.spdx.orgにその仕様が記載されている。

source: A documented FOSS contribution policy exists;
ja: FOSSコントリビューション ポリシーが文書化されている。

source: A documented FOSS policy exists.
ja: 文書化されたFOSS ポリシーが存在する。

source: A documented procedure exists describing a process that ensures the Distributed Compliance Artifacts be distributed with Supplied Software as required by the Identified Licenses.
ja: 確認ライセンスの要求に基づいて、頒布コンプライアンス関連資料が供給ソフトウェアとともに頒布されることを確実にするプロセスを説明した手続きが文書化されている。

source: A documented procedure exists for handling the review and remediation of non-compliant cases.
ja: 遵守されていない状況での調査や改善を取り扱うための手続きが文書化されている。

source: A documented procedure exists for identifying, tracking and archiving information about the collection of FOSS components from which a Supplied Software release is comprised.
ja: リリースされた供給ソフトウェアを構成するFOSSコンポーネント集について情報を特定し、追跡し、保管するための手続きが文書化されている。

source: A documented procedure exists that assigns internal responsibilities for FOSS compliance.
ja: FOSSコンプライアンスの内部責任者をアサインする手続きが文書化されている。

source: A documented procedure exists that assigns responsibilities for FOSS compliance.
ja: FOSSコンプライアンスの責任者をアサインする手続きが文書化されている。

source: A documented procedure exists that assigns responsibility for receiving FOSS compliance inquiries.
ja: FOSSコンプライアンスの問い合わせに対応する責任者をアサインするための手続きが文書化されている。

source: A documented procedure exists that ensures the Compliance Artifacts are prepared and distributed with Supplied Software release as required by the Identified Licenses.
ja: コンプライアンス関連資料が用意され、それらが確認ライセンスの要求するとおりに供給ソフトウェアのリリースと併せ頒布されることを確かにする手続きが文書化されている。

source: A documented procedure exists that identifies an escalation path for issue resolution.
ja: 問題の解決のためのエスカレーション パスを明確にした手続きが文書化されている。

source: A documented procedure exists that makes all Software Staff aware of the existence of the FOSS contribution policy (e.g., via training, internal wiki, or other practical communication method).
ja: FOSSコントリビューション ポリシーの存在を（トレーニングや社内Wiki、その他実践的なコミュニケーションを通じて）すべてのソフトウェア スタッフに認知させる手続きが文書化されている。

source: A documented procedure exists that makes all Software Staff aware of the existence of the FOSS policy (e.g., via training, internal wiki, or other practical communication method).
ja: すべてのソフトウェア スタッフが（トレーニングや社内wiki、その他実践的なコミュニケーションを通じて）FOSSポリシーの存在を知ることのできる文書化された手続きが存在する。

source: A documented procedure exists to review and document the obligations, restrictions and rights granted by each Identified License governing the Supplied Software.
ja: 供給ソフトウェアを統制している確認ライセンスそれぞれが供与する義務、制約および権利についてレビューし、記録するための手続きが文書化されている。

source: A documented procedure exists used to identify, track, and archive a list of FOSS components and their Identified Licenses from which the Supplied Software is comprised.
ja: 供給ソフトウェアに含まれるすべてのFOSSコンポーネントとそれらの確認ライセンスを特定し、追跡し、リストとして保管するための手続きが文書化されている。

source: A policy may exist such that contributions are not permitted at all.
ja: コントリビューションが許容されてない場合においても、ポリシーは存在した方がよいでしょう。

source: A procedure has been implemented that handles the common FOSS license use cases for the FOSS components of each Supplied Software release.
ja: 供給ソフトウェアそれぞれのリリースのFOSSコンポーネントに対し、共通的なFOSSライセンスのユースケースを取り扱うプロセスが整備されている。

source: A process exists for creating and managing a FOSS component bill of materials which includes each component (and its Identified Licenses) in a Supplied Software release.
ja: リリースされた供給ソフトウェアについて、各FOSSコンポーネント（およびその確認ライセンス）を含む部品表（Bill of material）を作り、管理するためのプロセスが存在すること。

source: A process exists for identifying, tracking and archiving a list of all FOSS components (and their respective Identified Licenses) from which Supplied Software is comprised.
ja: 供給ソフトウェアに含まれるすべてのFOSSコンポーネント（およびそれぞれの確認ライセンス）を特定し、追跡し、リストとして保管するプロセスが存在すること。

source: A process exists for reviewing the Identified Licenses to determine the obligations, restrictions and rights granted by each license.
ja: 供与される義務、制約および権利を判断するための確認ライセンスをレビューするプロセスが存在すること。

source: A process exists for the resolution of FOSS compliance issues.
ja: FOSSコンプライアンスに関わる諸問題を解決するためのプロセスが存在していること。

source: A process has been implemented that is capable of addressing the typical FOSS use
ja: 典型的なFOSSの

source: A process has been implemented that is capable of addressing the typical FOSS use cases encountered by Software Staff for Supplied Software.
ja: ソフトウェア スタッフが扱う供給ソフトウェアの代表的なFOSSユースケースに対応するためのプロセスが整備されている。

source: A study group was formed to consider whether a standard program specification could be created that would: i) facilitate greater quality and consistency of open source compliance information being shared across the industry; and ii) decrease the high transaction costs associated with open source resulting from compliance rework.
ja: こうした背景から、標準的なコンプライアンス プログラムの仕様書を整備できるかどうかを検討する研究グループが形成されました。この仕様書は、i）業界全体で共有されるオープンソース コンプライアンス関連情報の品質と一貫性の向上促進、および、ii）コンプライアンス作業の再実施に起因するオープンソース関連の作業コストの低減、を実現するものです。

source: A test may be used to allow Software Staff to satisfy the training requirement.
ja: ソフトウェア スタッフがトレーニング要件を満たしていることを認めるために試験を実施する場合もある。

source: A written FOSS policy exists that governs FOSS license compliance of the Supplied Software distribution where, as a minimum, it must be internally communicated.
ja: 供給ソフトウェアの頒布についてFOSSライセンス コンプライアンスを統制するFOSSポリシーが書面として存在し、少なくともそれが組織内に周知されていること。

source: A written FOSS policy exists that governs FOSS license compliance of the Supplied Software distribution.
ja: 供給ソフトウェアの頒布についてFOSSライセンス コンプライアンスを統制するFOSSポリシーが書面として存在していること。

source: A written policy exists that governs contributions to FOSS projects by the organization.
ja: FOSSプロジェクトに対しコントリビュートすることを統制するポリシーが文書化されていること。

source: A written policy exists that governs contributions to publicly accessible FOSS projects by employees on behalf of the organization where, as a minimum, it must be internally communicated.
ja: 公的にアクセス可能なFOSSプロジェクトに対し、従業員がその企業を代表してコントリビュートすることを統制するポリシーが文書化されており、最低限、それが組織内に周知されていること。

source: Although no requirements are provided here on what should be included in the policy, other requirements in other sections may.
ja: FOSSポリシーに含まれるべき内容についてはここで提示されませんが、他の要件で提示されることがあります。

source: Although no requirements are provided here on what should be included in the policy, other sections may impose requirements on the policy.
ja: FOSSポリシーに含まれるべき内容についてはここで提示されませんが、他の節でポリシー上の要件として課される場合があります。

source: An internal documented procedure exists that assigns responsibility for receiving FOSS compliance inquiries.
ja: FOSSコンプライアンスの問い合わせに対応する責任者をアサインするための手続きが内部文書化されている。

source: Appendix I: Language Translations
ja: 付録I：言語翻訳について

source: As a consequence, at each tier of the supply chain, downstream organizations were frequently redoing the compliance work already performed by other upstream organizations.
ja: そしてその結果、サプライチェーンの各段階で、上流側組織が既に実行したコンプライアンス業務を下流側組織が頻繁に再実行していました。

source: Assign individual(s) responsible for managing internal FOSS compliance.
ja: 組織内部のFOSSコンプライアンスを管理する責任者をアサインすること。

source: Assign individual(s) responsible for receiving external FOSS inquiries;
ja: FOSSに関する外部からの問い合わせに対応する責任者をアサインすること。

source: Assign responsibilities to develop and maintain FOSS compliance policy and processes;
ja: FOSSコンプライアンスのポリシーとプロセスを策定および維持するための責任者をアサインすること。

source: At least 85% of all Software Staff are current, as per definition in above section.
ja: 全ソフトウェア スタッフのうち少なくとも85%が、本節上記で定義したような最新の状況に即した状態にある。

source: At least 85% of the Software Staff are current, as per the definition in above section.
ja: ソフトウェア スタッフのうち少なくとも85%が、本節上記で定義したような最新の状況に即した状態にある。

source: Basics of IP law pertaining to FOSS and FOSS licenses;
ja: FOSSおよびFOSSライセンスに付随する知的財産権関連法令の基礎

source: Basics of Intellectual Property law pertaining to FOSS and FOSS licenses;
ja: FOSSおよびFOSSライセンスに付随する知的財産権関連法令の基礎

source: Because OpenChain functions as an open source project translations are driven by those willing to contribute their time and expertise to perform translations under the terms of the CC-BY 4.0 license and the project’s translation policy.
ja: OpenChainはオープンソース プロジェクトとして機能するため、各種翻訳は時間と専門的知見をコントリビュートすることに前向きな方々によって、CC-BY-4.0ライセンスとプロジェクトの翻訳ポリシーの下で推進されます。

source: Commercially reasonable budget has been allocated.
ja: 商業的に合理的な予算が配分されている。

source: Conformance validation requirements can be found on the OpenChain project’s website.
ja: 適合認定のための要件はOpenChainプロジェクトのWebサイトで確認できる。

source: Conformance with this version of the specification will last 18 months from the date conformance validation was achieved.
ja: 本版の仕様書への適合は、適合が認定された日から18か月間持続する。

source: Contents
ja: 目次

source: Copies of the Compliance Artifacts of the Supplied Software release are archived and easily retrievable, and the archive is planned to exist for at least as long as the Supplied Software is offered or as required by the Identified Licenses (whichever is longer)
ja: 供給ソフトウェアに関するコンプライアンス関連資料の写しが保管され、容易に取り出すことができる。また、少なくとも当該供給ソフトウェアが提供され続けている期間、または確認ライセンスが要求する期間（のいずれか長い方の期間）は、本保管物が存在するように計画されている。

source: Copies of the Distributed Compliance Artifacts of the Supplied Software are archived and easily retrievable (e.g., legal notices, source code, SPDX documents), and the archive is planned to exist for at least as long as the Supplied Software is offered or as required by the Identified Licenses (whichever is longer).
ja: 供給ソフトウェアに関する頒布コンプライアンス関連資料のコピーが保管され、容易に取り出すことができる（法的告知、ソースコード、SPDXドキュメントなど）。また、少なくとも当該供給ソフトウェアが提供され続けている期間、または確認ライセンスが要求する期間（いずれか長い方の期間）は、本保管物が存在するように立案されている。

source: Copyright and License
ja: 著作権、ライセンス

source: Copyright © 2016 Linux Foundation.
ja: Copyright © 2016 The Linux Foundation.

source: Definitions
ja: 用語の定義

source: Depending on the organization, that may include (but is not limited to) software developers, release engineers, quality engineers, product marketing and product management.
ja: 組織によって異なるが、ソフトウェア開発者、リリース エンジニア、品質管理技術者、プロダクト マーケティング担当者、プロダクト管理者などが含まれる（ただし、この限りではない）。

source: Disclaimer
ja: 免責事項（Disclaimer）

source: Distributed Compliance Artifacts - the set of artifacts that an Identified License requires be provided with Supplied Software.
ja: 頒布コンプライアンス関連資料（Distributed Compliance Artifacts）－確認済みライセンスによって供給ソフトウェアとともに提供を求められる生成物一式のこと。

source: Ensure an organization has a documented process for how the organization publicly contributes FOSS.
ja: 組織が公的にFOSSにコントリビュートする方法について文書化されたプロセスを有することを確かなものにします。

source: Ensure an organization has given reasonable consideration to developing a policy with respect to publicly contributing to FOSS.
ja: FOSSへの公的なコントリビューションに関するポリシーの作成について、組織が十分に検討していることを確かなものとします。

source: Ensure certain FOSS responsibilities have been effectively assigned.
ja: 適切なFOSS責任者が効果的にアサインされたことを確かなものにします。

source: Ensure steps were taken to create, record and make Software Staff aware of the existence of a FOSS policy.
ja: FOSSポリシーを作成・記録するステップが取られ、ソフトウェア スタッフにFOSSポリシーの存在を知らせることを確かなものにします。

source: Ensure the Software Staff have recently attended FOSS training and that a core set of relevant FOSS topics are covered.
ja: ソフトウェア スタッフが最新のFOSSトレーニングに参加したこと、およびそのトレーニングでFOSS関連の適切なトピックが取り扱われていることを確かなものにします。

source: Ensure the complete collection of Compliance Artifacts accompany the Supplied Software as required by the Identified Licenses that govern the Supplied Software along with other reports created as part of the FOSS review process.
ja: 供給ソフトウェアを統制する確認ライセンスの要求に基づいてコンプライアンス関連資料が完備され、その他FOSSレビュープロセスで生成されたレポートと併せて供給ソフトウェアに添付されることを確かなものにします。

source: Ensure the complete collection of compliance artifacts accompany the Supplied Software as required by the Identified Licenses that govern the Supplied Software.
ja: 供給ソフトウェアを統制する 確認ライセンスの要求に基づいて、コンプライアンス関連資料が完備され、供給ソフトウェアに添付されることを確かなものにします。

source: Ensure there is a reasonable way for third parties to contact the organization with regard to FOSS compliance inquiries and that this responsibility has been effectively assigned.
ja: FOSSコンプライアンスの問い合わせについて、第三者がその組織にコンタクトできる合理的な手段があり、責任者が効果的にアサインされていることを確かなものとします。

source: Ensure there is a reasonable way for third parties to contact the organization with regard to FOSS compliance inquiries.
ja: FOSSコンプライアンスの問い合わせについて、第三者がその組織にコンタクトできる合理的な手段があることを確かなものにします。

source: Escalation path is available for resolution of FOSS compliance issues.
ja: FOSSコンプライアンスに関わる諸問題を解決するためにエスカレーション パスが有効となっていること。

source: FOSS (Free and Open Source Software) - software subject to one or more licenses that meet the Open Source Definition published by the Open Source Initiative (OpenSource.org) or the Free Software Definition (published by the Free Software Foundation) or similar license.
ja: FOSS（フリー／オープンソース ソフトウェア）－Open Source Initiative（OpenSource.org）によって公開されているオープンソースの定義や（Free Software Foundationによって公開されている） フリー ソフトウェアの定義に該当または類似したライセンスの1つもしくはそれ以上に従うソフトウェアのこと。

source: FOSS Liaison - a designated person who is assigned to receive external FOSS inquires.
ja: FOSS 窓口（FOSS Liaison）－FOSSに関し、外部からの問い合わせに対応するためにアサインされた担当者のこと。

source: FOSS Liaison function is publicly identified (e.g., via a published contact email address, or the Linux Foundation's Open Compliance Directory).
ja: OSSに関する窓口機能が（たとえば電子メールアドレスやLinux Foundationオープン コンプライアンス ディレクトリを通じて）公的に明示されている。

source: FOSS Liaison function is publicly identified (e.g., via an email address and/or the Linux Foundation’s Open Compliance Directory).
ja: FOSSに関する窓口機能が（たとえば電子メールアドレスやLinux Foundationオープン コンプライアンス ディレクトリを通じて）公的に明示されている。

source: FOSS Liaison must make commercially reasonable efforts to respond to FOSS compliance inquiries as appropriate; and
ja: FOSS窓口はFOSSコンプライアンスの問い合わせに対し、商業的に合理的な努力を払い適切に対応すること。

source: FOSS compliance management activity is sufficiently resourced:
ja: FOSSコンプライアンス管理に十分な活動資源が提供されていること。

source: FOSS component records exist for each Supplied Software release which demonstrates the documented procedure was properly followed.
ja: 供給ソフトウェアの各リリースに対し、FOSSコンポーネントの記録が存在し、文書化された手続きに適切に従っていることを示している。

source: FOSS course materials covering the above topics exists (e.g., slide decks, online course, or other training materials).
ja: 上記のトピックを含んだFOSS教材（たとえばスライドやオンライン コースなどのトレーニング用資料）が存在する。

source: FOSS licensing concepts (including the concepts of permissive and copyleft licenses);
ja: FOSSライセンスの概念（コピーレフト ライセンスやパーミッシブなライセンスの概念など）

source: FOSS project licensing models;
ja: FOSSプロジェクトのライセンス供与のモデル

source: FOSS training materials covering the above topics exists (e.g., slide decks, online course, or other training materials).
ja: 上記のトピックを含んだFOSSトレーニング教材（たとえばスライドやオンライン コース、その他のトレーニング用資料）が存在する。

source: G1: Know Your FOSS Responsibilities
ja: G1: FOSSに関わる責任の理解

source: G2: Assign Responsibility for Achieving Compliance
ja: G2: コンプライアンスを履行するための責任者のアサイン

source: G3: Review and Approve FOSS Content
ja: G3: FOSSコンテンツのレビューと承認

source: G4: Deliver FOSS Content Documentation and Artifacts
ja: G4: FOSSコンテンツ ドキュメントとコンプライアンス関連資料の頒布

source: G5: Understand FOSS Community Engagement
ja: G5: FOSSコミュニティへの（積極的な）関わり方の理解

source: G6: Certify Adherence to OpenChain Requirements
ja: G6: OpenChain要件適合の認定

source: Identified Licenses - a set of FOSS licenses identified as a result of following an appropriate method of identifying such licenses.
ja: 確認ライセンス（Identified License）－適切なライセンス確認手順の結果として存在の確認ができた一連のFOSSライセンスのこと。

source: Identify FOSS Liaison Function ("FOSS Liaison").
ja: FOSSに関する窓口機能を明確にすること（「FOSS窓口」）。

source: Identify Internal FOSS Compliance Role(s).
ja: 組織内部におけるFOSSコンプライアンスを履行する役割を明確にすること。

source: Identify source of legal expertise available to FOSS Compliance role(s) which could be internal or external.
ja: FOSSコンプライアンスの履行担当者が利用可能な、内部・外部の法的専門知識の情報源が特定されている。

source: Identify source of legal expertise available to FOSS Compliance role(s).
ja: FOSSコンプライアンスの履行担当者が利用可能な法的専門知識の情報源が特定されている。

source: If all the requirements have been met for a given program, it would be considered OpenChain Conforming in accordance with version 1.0 of the specification.
ja: すべての要件をそのコンプライアンス プログラムが満たしている場合には、仕様書第1.0版における「OpenChain適合（OpenChain Conforming）」とみなされます。

source: If all the requirements have been met for a given program, it would be considered OpenChain Conforming in accordance with version 1.1 of the specification.
ja: すべての要件をそのコンプライアンス プログラムが満たしている場合には、仕様書第1.1版における「OpenChain適合（OpenChain Conforming）」とみなされます。

source: If an organization permits contributions to FOSS projects then a process must exist that implements the FOSS contribution policy outlined in Section 5.1.
ja: FOSSプロジェクトへのコントリビューションを組織が許容する場合、5.1節に挙げたコントリビューション ポリシーを実践するプロセスが整備されていること。

source: In accordance with the Vision and Mission, this specification defines a set of requirements that if met, would significantly increases the probability that an open source compliance program had achieved a sufficient level of quality, consistency and completeness; although a program that satisfies all the specification requirements does not guarantee full compliance.
ja: 上記のビジョンとミッションに則り、本仕様書では一連の要件を定義しています。これらを満たすことで、オープンソース コンプライアンス プログラムの品質、一貫性、および完全性が十分なレベルに到達する可能性が大きく高まります。ただし、本要件のすべてを満たしても、そのプログラムが全面的にコンプライアンスを履行していることを保証するものではありません。

source: In order for an organization to be OpenChain certified, it must affirm that it has a FOSS management program that meets the criteria described in this OpenChain Specification version 1.1.
ja: 組織がOpenChainに適合していると認定されるためには、本OpenChain仕様書第1.1版に記載された基準を満たすFOSSマネジメント プログラムを有していることを確認する必要がある。

source: In order for an organization to be OpenChain certified, it must affirm that it has a FOSS program that meets the criteria described in this OpenChain Conformance Specification version 1.0.
ja: 組織がOpenChainに適合していると認定されるためには、本OpenChain適合仕様書第1.0版に記載された基準を満たすFOSSコンプライアンス プログラムを有していることを確認する必要がある。

source: In that situation it is understood that no procedure may exist and this requirement would nevertheless be met.
ja: そのような状況においてはプロセスが存在しないと理解され、本要件が満たされたことになります。

source: In that specific situation it is understood that no process may exist and this requirement would nevertheless be met.
ja: そのような状況においては、具体的な行動のプロセスは存在しないと理解され、本要件が満たされたことになります。

source: In the situation where contributions are not permitted at all, a policy should exist making that position clear.
ja: コントリビューションがまったく許容されていない状況の場合は、その立場を明確に示すポリシーの存在が必要です。

source: Introduction
ja: はじめに

source: It is important for the organization to remains current with the specification if they want to assert program conformance overtime.
ja: その組織が一定期間を超えてプログラムの適合を主張する場合、本仕様書に即している状態を保つことが重要となります。

source: Legal expertise pertaining to FOSS compliance is accessible to the FOSS Compliance role (e.g., could be internal or external); and
ja: FOSSコンプライアンスの履行担当者がFOSSコンプライアンスに関する法的な専門知識を（その組織内もしくは組織外で）獲得できること。

source: Mandatory FOSS training for all Software Staff exists such that:
ja: すべてのソフトウェア スタッフに対して、受講必須のトレーニングが存在すること。

source: Method of tracking the completion of the course for all Software Staff.
ja: ソフトウェア スタッフ全員についてコースの修了を追跡する手段がある。

source: Method of tracking the completion of the training for all Software Staff.
ja: ソフトウェア スタッフ全員について、トレーニングの修了を追跡する手段がある。

source: Mission: Establish requirements to achieve effective management of free/open source software (FOSS) for software supply chain participants, such that the requirements and associated collateral are developed collaboratively and openly by representatives from the software supply chain, open source community, and academia.
ja: ミッション: フリー/オープンソース ソフトウェア(FOSS)の効果的マネジメントを実現するための 要件 をソフトウェア サプライチェーンに参加する人たちのために確立すること。こういった要件や関連する付随事項は、オープンに、ソフトウェア・サプライチェーン、オープンソース ・コミュニティやアカデミア（学術研究機関）の関係者それぞれがオープンに協働しながら開発を進めていきます

source: Name of persons, group or function in FOSS Compliance role(s) identified.
ja: FOSSコンプライアンスの履行担当者名、グループ名または役割名称が特定できる。

source: Name of persons, group or function in FOSS Compliance role(s) internally identified.
ja: FOSSコンプライアンスの役割を有する履行担当者名、グループまたは機能の名称が内部で特定できる。

source: OpenChain Conformance Specification
ja: OpenChain 適合仕様書

source: OpenChain Conformance Specification 1.0
ja: OpenChain 適合仕様書 第1.0版

source: OpenChain Conforming - a program that satisfies all the requirements of this specification.
ja: OpenChain適合（OpenChain Conforming）－本仕様書のすべての要件を満たすコンプライアンス プログラムのこと。

source: OpenChain Conforming – a program that satisfies all the requirements of this specification.
ja: OpenChain適合（Open Chain Conforming）－本仕様書のすべての要件を満たすコンプライアンス プログラムのこと。

source: OpenChain Specification
ja: OpenChain 仕様書

source: Prepare the following Distributed Compliance Artifacts to accompany the Supplied Software as required by the corresponding Identified Licenses which might include (but is not limited to) the required:
ja: 供給ソフトウェアの確認ライセンスに応じて要求される、以下の頒布コンプライアンス関連資料が用意されていること（ただし、この限りではない）。

source: Prepare the set of artifacts which represent the output of the FOSS management program for each Supplied Software release.
ja: 供給ソフトウェアの各リリースに対し、FOSSのマネジメント プログラムによる生成物一式が用意されていること。

source: Process for identifying, recording and/or tracking of FOSS components contained in Supplied Software.
ja: 供給ソフトウェアのFOSSコンポーネントを特定、記録、および追跡するためのプロセス

source: Provided the FOSS contribution policy permits contributions, a documented procedure exists that describes the FOSS contribution process.
ja: FOSSコントリビューション ポリシーがコントリビューションを許容するものである場合、FOSSコントリビューションのプロセスを記載した手続きが文書化されている。

source: Provided the FOSS contribution policy permits contributions, a documented procedure exists that governs FOSS contributions.
ja: FOSSコントリビューション ポリシーがコントリビューションを許容するものである場合、FOSSコントリビューションを統制する手続きが文書化されている。

source: Provided the FOSS contribution policy permits such contributions, a process exists for confirming contributions adhere to the FOSS contribution policy, which might include (but is not limited to) the following considerations:
ja: FOSSコントリビューション ポリシーがコントリビューションを許容するものである場合、コントリビューションがFOSSコントリビューション ポリシーに忠実に従っていることを確認するために、以下の検討事項を含むプロセスが存在していること（ただし、この限りではない）。

source: Publicly identify a means by which one can contact the FOSS Liaison.
ja: FOSS窓口にコンタクトする手段を公的に明らかにすること。

source: Publicly identify means of contacting the FOSS Liaison by way of electronic communication.
ja: 電子的通信を通じてFOSS窓口にコンタクトする手段を公的に明らかにすること。

source: Rationale:
ja: 論拠：

source: Requirements
ja: 満たすべき要件

source: SPDX or Software Package Data Exchange - the format standard created by the SPDX Working Group for exchanging license and copyright information for a given software package.
ja: SPDX もしくはSoftware Package Data Exchange－SPDXワーキング グループによって作られ、ライセンスや著作権情報をやりとりすることを目的としたフォーマット標準のこと。

source: SPDX or Software Package Data Exchange – the format standard created by the SPDX Working Group for exchanging license and copyright information for a given software package.
ja: SPDX もしくはSoftware Package Data Exchange－SPDXワーキング グループによって作られ、ライセンスや著作権情報をやりとりすることを目的としたフォーマット標準のこと。
